Repository: eddyem/snippets_library
Catalog: locale/*/*.po
Languages: ru

source: sl_get_keyval(): key would be trunkated to %d symbols
ru: sl_get_keyval(): ключ будет обрезан до %d символов

source: Can't open %s
ru: Не могу открыть %s

source: sl_conf_showhelp(): wrong index
ru: sl_conf_showhelp(): неверный индекс

source: Found running process (pid=%d), exit.
ru: Обнаружен одноименный процесс (pid=%d), выход.

source: Can't read self name
ru: Не могу прочесть имя процесса

source: Can't open PID file
ru: Не могу открыть PID файл

source: Wrong helpstring!
ru: Неправильный формат строки помощи

source: Integer out of range
ru: Целое вне допустимого диапазона

source: No such parameter: `%s`
ru: Нет такого параметра: %s

source: Parameter `%s` needs value
ru: Ключ '%s' требует значения

source: Can't use multiple args with arg_none!
ru: Массив параметров не может иметь тип arg_none!

source: double long arguments: --%s
ru: дублирующийся длинный параметр: --%s

source: double short arguments: -%c
ru: дублирующийся короткий параметр: -%c

source: Need argument with %s type
ru: Необходим аргумент с типом %s

source: sl_showhelp(): option index out of range
ru: sl_showhelp(): индекс опции вне допустимого диапазона

source: Usage: %s [arguments]
ru: Использование: %s [аргументы]

source: Wrong parameter: %s
ru: Неправильный параметр: %s

source: %s: need argument!
ru: %s: необходим аргумент!

source: Wrong argument "%s" of parameter "%s"
ru: Неправильный аргумент "%s" параметра "%s"

source: Server disconnected
ru: Сервер отключен

source: Can't start server handlers thread
ru: Не могу запустить поток-обработчик сервера

source: Limit of connections reached
ru: Достигнут предел соединений

source: Server thread: ring buffer overflow for fd=%d
ru: Поток сервера: переполнение буфера от fd=%d

source: Server thread: can't write data to ringbuffer: overflow from fd=%d
ru: Поток сервера: не могу сохранить данные в кольцевом буфере, переполнение от fd=%d

source: Server thread: buffer overflow from fd=%d
ru: Поток сервера: переполнение буфера от fd=%d

source: Unsupported socket type %d
ru: Неподдерживаемый тип сокета %d

source: Wrong USART format "%s"; use NPS, where N: 5..8; P: N/E/O/1/0, S: 1/2
ru: Неправильный формат USART "%s"; нужен NPS, где N: 5..8; P: N/E/O/1/0, S: 1/2

source: Can't use port %s
ru: Не могу использовать порт %s

source: Can't get old TTY settings
ru: Не могу получить действующие настройки порта

source: Can't apply new TTY settings
ru: Не могу сменить настройки порта

source: Can't set speed %d, got ispeed=%d, ospeed=%d
ru: Не могу сменить скорость на %d; ispeed=%d, ospeed=%d

source: Can't do exclusive open
ru: Не могу перевести порт в эксклюзивный режим

source: Port name is missing
ru: Отсутствует имя порта

source: Need non-zero buffer for TTY device
ru: Для последовательного устройства требуется буфер ненулевого размера

source: Can't open /dev/random
ru: Не могу открыть /dev/random

source: Can't read /dev/random
ru: Не могу прочесть /dev/random

source: No filename given!
ru: Не задано имя файла!

source: Can't open %s for reading
ru: Не могу открыть %s для чтения

source: Can't stat %s
ru: Не могу выполнить stat %s

source: Mmap error for input
ru: Ошибка mmap

source: Can't close mmap'ed file
ru: Не могу закрыть mmap'нутый файл

source: Can't munmap
ru: Не могу munmap

source: Can't setup console
ru: Не могу настроить консоль
